; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation11 - direction
	Star7 - direction
	Star10 - direction
	Star8 - direction
	GroundStation14 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation6 - direction
	Star9 - direction
	Star1 - direction
	Star13 - direction
	GroundStation12 - direction
	Star4 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star7)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star13)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument5 thermograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star9)
	(supports instrument6 thermograph2)
	(supports instrument6 image0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation12)
	(calibration_target instrument6 Star13)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star18)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star10)
	(pointing satellite2 Star18)
	(pointing satellite3 GroundStation5)
	(have_image Planet15 image0)
	(have_image Star16 thermograph2)
	(have_image Star17 thermograph2)
	(have_image Star18 thermograph2)
	(have_image Planet19 image0)
	(have_image Phenomenon20 thermograph2)
	(have_image Star21 thermograph2)
))

)

; plan
1. (turn_to satellite2 star18 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star18)
   goals met: 1 of 11
2. (turn_to satellite1 star10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star10)
   goals met: 2 of 11
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
4. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 2 of 11
5. (turn_to satellite0 planet19 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet19)
   goals met: 2 of 11
6. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 3 of 11
7. (turn_to satellite0 planet15 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet15)
   goals met: 3 of 11
8. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 11
9. (turn_to satellite0 phenomenon20 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon20)
   goals met: 4 of 11
10. (take_image satellite0 phenomenon20 instrument0 thermograph2)
   added: (have_image phenomenon20 thermograph2)
   goals met: 5 of 11
11. (turn_to satellite0 star16 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 star16)
   goals met: 5 of 11
12. (take_image satellite0 star16 instrument0 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 6 of 11
13. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 6 of 11
14. (take_image satellite0 star17 instrument0 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 7 of 11
15. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 7 of 11
16. (take_image satellite0 star18 instrument0 thermograph2)
   added: (have_image star18 thermograph2)
   goals met: 8 of 11
17. (turn_to satellite0 star21 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star21)
   goals met: 8 of 11
18. (take_image satellite0 star21 instrument0 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 9 of 11
19. (turn_to satellite0 star2 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star2)
   goals met: 10 of 11
20. (turn_to satellite3 groundstation5 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 groundstation5)
   goals met: 11 of 11
